# Column and Row Elimination 
Drop() function is used to eliminate columns or rows in the DataFrame.

In [1]:
import numpy as np
import pandas as pd

from pandas import Series, DataFrame

### Series

In [2]:
ser1 = Series(np.arange(1,5),index=['row1','row2','row3','row4'])
ser1

row1    1
row2    2
row3    3
row4    4
dtype: int32

In [3]:
ser1.drop('row1')

row2    2
row3    3
row4    4
dtype: int32

In [4]:
ser1

row1    1
row2    2
row3    3
row4    4
dtype: int32

In [5]:
ser1.drop('row1',inplace=True)
ser1

row2    2
row3    3
row4    4
dtype: int32

In [6]:
ser1.drop(['row2','row3'])
ser1

row2    2
row3    3
row4    4
dtype: int32

### DataFrames

In [7]:
df = DataFrame(np.arange(25).reshape(5,5),
               index=['row1','row2','row3','row4','row5'],
               columns=['col1','col2','col3','col4','col5'])
df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19
row5    20    21    22    23    24

In [8]:
df.drop('col1',axis=1)

      col2  col3  col4  col5
row1     1     2     3     4
row2     6     7     8     9
row3    11    12    13    14
row4    16    17    18    19
row5    21    22    23    24

In [9]:
df.drop(columns='col1')

      col2  col3  col4  col5
row1     1     2     3     4
row2     6     7     8     9
row3    11    12    13    14
row4    16    17    18    19
row5    21    22    23    24

In [10]:
df.drop('row1',axis=0)

      col1  col2  col3  col4  col5
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19
row5    20    21    22    23    24

In [11]:
df

      col1  col2  col3  col4  col5
row1     0     1     2     3     4
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19
row5    20    21    22    23    24

In [12]:
df.drop(index='row1',inplace=True)

In [13]:
df

      col1  col2  col3  col4  col5
row2     5     6     7     8     9
row3    10    11    12    13    14
row4    15    16    17    18    19
row5    20    21    22    23    24

In [15]:
df.drop(['row2','row3'],axis=0)

      col1  col2  col3  col4  col5
row4    15    16    17    18    19
row5    20    21    22    23    24